EDT/УТ/src/Reports/СписокЗаказовДляПроверкиSLУровня/СписокЗаказовДляПроверкиSLУровня.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>СписокЗаказовДляПроверкиSLУровня</name>
</mdclass:Report>

EDT/УТ/src/InformationRegisters/СостоянияЗаказов/СостоянияЗаказов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СостоянияЗаказов</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>РезультатДоставки</name>
    <type>
      <types>CatalogRef.новаРезультатМестнойДоставки</types>
    </type>
  </resources>
  <resources>
    <name>ПричинаНеВыполнения</name>
    <type>
      <types>CatalogRef.ПричиныНеВыполненияДоставки</types>
    </type>
  </resources>
  <resources>
    <name>ПричинаОтказа</name>
    <type>
      <types>CatalogRef.ПричиныОтказаПереноса</types>
    </type>
  </resources>
  <resources>
    <name>ДатаПереноса</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>Экспедитор_КУдалению</name>
    <type>
      <types>CatalogRef.новаЭкспедиторы</types>
    </type>
  </resources>
  <resources>
    <name>Водитель_КУдалению</name>
    <type>
      <types>CatalogRef.новаВодители</types>
    </type>
  </resources>
  <resources>
    <name>СторонаПретензий</name>
    <type>
      <types>EnumRef.СторонаПретензий</types>
    </type>
  </resources>
  <resources>
    <name>Инициатор</name>
    <type>
      <types>EnumRef.ИнициаторыСостояния</types>
    </type>
  </resources>
  <resources>
    <name>Рейс</name>
    <type>
      <types>DocumentRef.Рейс</types>
    </type>
  </resources>
  <resources>
    <name>ДатаДоставки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Доставка</name>
    <type>
      <types>BusinessProcessRef.новаМестнаяДоставка</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Заказ</name>
    <type>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

EDT/УТ/src/InformationRegisters/СостоянияЗаказовРасширенный/СостоянияЗаказовРасширенный.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СостоянияЗаказовРасширенный</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>РезультатДоставки</name>
    <type>
      <types>CatalogRef.новаРезультатМестнойДоставки</types>
    </type>
  </resources>
  <resources>
    <name>ПричинаНеВыполнения</name>
    <type>
      <types>CatalogRef.ПричиныНеВыполненияДоставки</types>
    </type>
  </resources>
  <resources>
    <name>ПричинаОтказа</name>
    <type>
      <types>CatalogRef.ПричиныОтказаПереноса</types>
    </type>
  </resources>
  <resources>
    <name>ДатаПереноса</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>СторонаПретензий</name>
    <type>
      <types>EnumRef.СторонаПретензий</types>
    </type>
  </resources>
  <resources>
    <name>Инициатор</name>
    <type>
      <types>EnumRef.ИнициаторыСостояния</types>
    </type>
  </resources>
  <resources>
    <name>Рейс</name>
    <type>
      <types>DocumentRef.Рейс</types>
    </type>
  </resources>
  <resources>
    <name>ДатаДоставки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Заказ</name>
    <type>
      <types>DocumentRef.ЗаборТовара</types>
      <types>DocumentRef.Фрахт</types>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

EDT/УТ/src/InformationRegisters/ОперативныеСтатусыЗаказовПоДаннымМП/ОперативныеСтатусыЗаказовПоДаннымМП.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОперативныеСтатусыЗаказовПоДаннымМП</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Рейс</name>
    <type>
      <types>DocumentRef.Рейс</types>
    </type>
  </resources>
  <resources>
    <name>РезультатДоставки</name>
    <type>
      <types>CatalogRef.новаРезультатМестнойДоставки</types>
    </type>
  </resources>
  <resources>
    <name>ПричинаНеВыполнения</name>
    <type>
      <types>CatalogRef.ПричиныНеВыполненияДоставки</types>
    </type>
  </resources>
  <resources>
    <name>ПричинаОтказаПереноса</name>
    <type>
      <types>CatalogRef.ПричиныОтказаПереноса</types>
    </type>
  </resources>
  <dimensions>
    <name>Заказ</name>
    <type>
      <types>DocumentRef.ЗаборТовара</types>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

EDT/УТ/src/InformationRegisters/СтатусыЗаказов/СтатусыЗаказов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СтатусыЗаказов</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <attributes>
    <name>СтатусAxiomus</name>
    <type>
      <types>CatalogRef.СтатусыAxiomus</types>
    </type>
  </attributes>
  <dimensions>
    <name>Заказ</name>
    <type>
      <types>DocumentRef.ЗаборТовара</types>
      <types>DocumentRef.Фрахт</types>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Статус</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ДокументРегистратор</name>
    <type>
      <types>DocumentRef</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Терминал</name>
    <type>
      <types>CatalogRef.РегиональныеТерминалы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПредварительноеЗакрытие</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Инициатор</name>
    <type>
      <types>EnumRef.ИнициаторыСостояния</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

EDT/УТ/src/Documents/ЗаборТовара/ЗаборТовара.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаборТовара</name>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Телефон</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресДоставки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>101</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УслугиСД</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Транспорт</name>
    <type>
      <types>CatalogRef.новаТранспорт</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаДоставки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтатусИнтернетМагазина</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КомментарийСД</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерВнешнегоЗаказа</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтатусИнтернетМагазинаСпр</name>
    <type>
      <types>CatalogRef.СтатусЗаказаИнтернетМагазина</types>
    </type>
  </attributes>
  <attributes>
    <name>КатегорияДоставки</name>
    <type>
      <types>CatalogRef.КатегорииДоставки2014</types>
      <types>CatalogRef.КатегорииДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>СтоимостьДоставки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Водитель</name>
    <type>
      <types>CatalogRef.новаВодители</types>
    </type>
  </attributes>
  <attributes>
    <name>Экспедитор</name>
    <type>
      <types>CatalogRef.новаЭкспедиторы</types>
    </type>
  </attributes>
  <attributes>
    <name>ТочкаДоставки</name>
    <type>
      <types>CatalogRef.новаТочкиДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаборСВозвратом</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипОплаты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Грузополучатель</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ВремяДоставкиС</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяДоставкиПо</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТерминалПриемки</name>
    <type>
      <types>CatalogRef.РегиональныеТерминалы</types>
    </type>
  </attributes>
  <attributes>
    <name>ТерминалДоставки</name>
    <type>
      <types>CatalogRef.РегиональныеТерминалы</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбъемЗабора</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВесЗабора</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТарифнаяСетка</name>
    <type>
      <types>CatalogRef.ТарифныеСетки</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбъемВозвратныхЗаказов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗонаТарификации</name>
    <type>
      <types>CatalogRef.ГруппыРайонов</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбъемЗаказов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительныйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗакрытиеЗаказов</name>
    <comment>Реквизит для хранения истории по ЗакрытиямЗаказа</comment>
    <type>
      <types>DocumentRef.ЗакрытиеЗаказов</types>
    </type>
  </attributes>
  <attributes>
    <name>СкладМагазина</name>
    <type>
      <types>CatalogRef.СкладыМагазинов</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоПаллетПланируемое</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПризнакВозвратаПоставщику</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Вес</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>АПП</name>
    <attributes>
      <name>НомерАПП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаДобавления</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Возвраты</name>
    <attributes>
      <name>НомерЗаказа</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоМест</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЗаказыКЗабору</name>
    <attributes>
      <name>Заказ</name>
      <type>
        <types>DocumentRef.РеализацияТоваровУслуг</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоМест</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

EDT/УТ/src/Reports/СписокЗаказовДляПроверкиSLУровня/ObjectModule.bsl
Функция ПолучитьВнешниеНаборыДанных(НачалоПериода, ОкончаниеПериода, Контрагент)
	
	ВнешниеНаборыДанных = Новый Структура;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
	Запрос.УстановитьПараметр("НачалоПериода30", НачалоПериода - 30 * 86400);
	Запрос.УстановитьПараметр("ОкончаниеПериода", КонецДня(ОкончаниеПериода));
	Запрос.УстановитьПараметр("ОкончаниеПериода30",  КонецДня(ОкончаниеПериода + 30 * 86400));
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВложенныйЗапрос.Заказ КАК Заказ,
	|	МИНИМУМ(ВложенныйЗапрос.Период) КАК Период
	|ПОМЕСТИТЬ ВТ_Заказы
	|ИЗ
	|	(ВЫБРАТЬ
	|		СостоянияЗаказов.Заказ КАК Заказ,
	|		СостоянияЗаказов.Период КАК Период
	|	ИЗ
	|		РегистрСведений.СостоянияЗаказов КАК СостоянияЗаказов
	|	ГДЕ
	|		СостоянияЗаказов.Период МЕЖДУ &НачалоПериода30 И &ОкончаниеПериода30
	|		И СостоянияЗаказов.Заказ.ВладелецТовара = &Контрагент
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		СостоянияЗаказовРасширенный.Заказ,
	|		СостоянияЗаказовРасширенный.Период
	|	ИЗ
	|		РегистрСведений.СостоянияЗаказовРасширенный КАК СостоянияЗаказовРасширенный
	|	ГДЕ
	|		СостоянияЗаказовРасширенный.Период МЕЖДУ &НачалоПериода30 И &ОкончаниеПериода30
	|		И ВЫБОР
	|				КОГДА СостоянияЗаказовРасширенный.Заказ ССЫЛКА Документ.РеализацияТоваровУслуг
	|					ТОГДА ВЫРАЗИТЬ(СостоянияЗаказовРасширенный.Заказ КАК Документ.РеализацияТоваровУслуг).ВладелецТовара = &Контрагент
	|				ИНАЧЕ ВЫРАЗИТЬ(СостоянияЗаказовРасширенный.Заказ КАК Документ.ЗаборТовара).Контрагент = &Контрагент
	|			КОНЕЦ
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ОперативныеСтатусыЗаказовПоДаннымМП.Заказ,
	|		ОперативныеСтатусыЗаказовПоДаннымМП.Период
	|	ИЗ
	|		РегистрСведений.ОперативныеСтатусыЗаказовПоДаннымМП КАК ОперативныеСтатусыЗаказовПоДаннымМП
	|	ГДЕ
	|		ОперативныеСтатусыЗаказовПоДаннымМП.Период МЕЖДУ &НачалоПериода30 И &ОкончаниеПериода30
	|		И ВЫБОР
	|				КОГДА ОперативныеСтатусыЗаказовПоДаннымМП.Заказ ССЫЛКА Документ.РеализацияТоваровУслуг
	|					ТОГДА ВЫРАЗИТЬ(ОперативныеСтатусыЗаказовПоДаннымМП.Заказ КАК Документ.РеализацияТоваровУслуг).ВладелецТовара = &Контрагент
	|				ИНАЧЕ ВЫРАЗИТЬ(ОперативныеСтатусыЗаказовПоДаннымМП.Заказ КАК Документ.ЗаборТовара).Контрагент = &Контрагент
	|			КОНЕЦ) КАК ВложенныйЗапрос
	|
	|СГРУППИРОВАТЬ ПО
	|	ВложенныйЗапрос.Заказ
	|
	|ИМЕЮЩИЕ
	|	МИНИМУМ(ВложенныйЗапрос.Период) МЕЖДУ &НачалоПериода И &ОкончаниеПериода
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СостоянияЗаказов.Заказ КАК Заказ,
	|	ВЫБОР
	|		КОГДА ВТ_Заказы.Заказ ССЫЛКА Документ.РеализацияТоваровУслуг
	|			ТОГДА ВЫРАЗИТЬ(ВТ_Заказы.Заказ КАК Документ.РеализацияТоваровУслуг).НомерВнешнегоЗаказа
	|		ИНАЧЕ ВЫРАЗИТЬ(ВТ_Заказы.Заказ КАК Документ.ЗаборТовара).НомерВнешнегоЗаказа
	|	КОНЕЦ КАК НомерВнешнегоЗаказа,
	|	СостоянияЗаказов.Период КАК Период,
	|	СостоянияЗаказов.РезультатДоставки КАК РезультатДоставки,
	|	СостоянияЗаказов.ПричинаНеВыполнения КАК ПричинаНеВыполнения,
	|	СостоянияЗаказов.ПричинаОтказа КАК ПричинаОтказа,
	|	СостоянияЗаказов.Регистратор КАК Регистратор,
	|	1 КАК ИсточникСтатуса,
	|	ВЫБОР
	|		КОГДА СостоянияЗаказов.Рейс.ДатаРейса ЕСТЬ NULL
	|			ТОГДА НАЧАЛОПЕРИОДА(СостоянияЗаказов.Период, ДЕНЬ)
	|		КОГДА НАЧАЛОПЕРИОДА(СостоянияЗаказов.Период, ДЕНЬ) > СостоянияЗаказов.Рейс.ДатаРейса
	|			ТОГДА СостоянияЗаказов.Рейс.ДатаРейса
	|		ИНАЧЕ НАЧАЛОПЕРИОДА(СостоянияЗаказов.Период, ДЕНЬ)
	|	КОНЕЦ КАК ДатаСтатуса,
	|	СостоянияЗаказов.Рейс.ДатаРейса КАК ДатаРейса
	|ИЗ
	|	РегистрСведений.СостоянияЗаказов КАК СостоянияЗаказов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Заказы КАК ВТ_Заказы
	|		ПО (СостоянияЗаказов.Период МЕЖДУ &НачалоПериода И &ОкончаниеПериода30)
	|			И СостоянияЗаказов.Заказ = ВТ_Заказы.Заказ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СостоянияЗаказовРасширенный.Заказ,
	|	ВЫБОР
	|		КОГДА ВТ_Заказы.Заказ ССЫЛКА Документ.РеализацияТоваровУслуг
	|			ТОГДА ВЫРАЗИТЬ(ВТ_Заказы.Заказ КАК Документ.РеализацияТоваровУслуг).НомерВнешнегоЗаказа
	|		ИНАЧЕ ВЫРАЗИТЬ(ВТ_Заказы.Заказ КАК Документ.ЗаборТовара).НомерВнешнегоЗаказа
	|	КОНЕЦ,
	|	СостоянияЗаказовРасширенный.Период,
	|	СостоянияЗаказовРасширенный.РезультатДоставки,
	|	СостоянияЗаказовРасширенный.ПричинаНеВыполнения,
	|	СостоянияЗаказовРасширенный.ПричинаОтказа,
	|	СостоянияЗаказовРасширенный.Регистратор,
	|	2,
	|	ВЫБОР
	|		КОГДА СостоянияЗаказовРасширенный.Рейс.ДатаРейса ЕСТЬ NULL
	|			ТОГДА НАЧАЛОПЕРИОДА(СостоянияЗаказовРасширенный.Период, ДЕНЬ)
	|		КОГДА НАЧАЛОПЕРИОДА(СостоянияЗаказовРасширенный.Период, ДЕНЬ) > СостоянияЗаказовРасширенный.Рейс.ДатаРейса
	|			ТОГДА СостоянияЗаказовРасширенный.Рейс.ДатаРейса
	|		ИНАЧЕ НАЧАЛОПЕРИОДА(СостоянияЗаказовРасширенный.Период, ДЕНЬ)
	|	КОНЕЦ,
	|	СостоянияЗаказовРасширенный.Рейс.ДатаРейса
	|ИЗ
	|	РегистрСведений.СостоянияЗаказовРасширенный КАК СостоянияЗаказовРасширенный
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Заказы КАК ВТ_Заказы
	|		ПО (СостоянияЗаказовРасширенный.Период МЕЖДУ &НачалоПериода И &ОкончаниеПериода30)
	|			И СостоянияЗаказовРасширенный.Заказ = ВТ_Заказы.Заказ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ОперативныеСтатусыЗаказовПоДаннымМП.Заказ,
	|	ВЫБОР
	|		КОГДА ВТ_Заказы.Заказ ССЫЛКА Документ.РеализацияТоваровУслуг
	|			ТОГДА ВЫРАЗИТЬ(ВТ_Заказы.Заказ КАК Документ.РеализацияТоваровУслуг).НомерВнешнегоЗаказа
	|		ИНАЧЕ ВЫРАЗИТЬ(ВТ_Заказы.Заказ КАК Документ.ЗаборТовара).НомерВнешнегоЗаказа
	|	КОНЕЦ,
	|	ОперативныеСтатусыЗаказовПоДаннымМП.Период,
	|	ВЫБОР
	|		КОГДА ОперативныеСтатусыЗаказовПоДаннымМП.РезультатДоставки = ЗНАЧЕНИЕ(Справочник.новаРезультатМестнойДоставки.Выполнена)
	|				И НЕ СтатусыЗаказов.Заказ ЕСТЬ NULL
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.новаРезультатМестнойДоставки.ВыполненаЧастично)
	|		ИНАЧЕ ОперативныеСтатусыЗаказовПоДаннымМП.РезультатДоставки
	|	КОНЕЦ,
	|	ОперативныеСтатусыЗаказовПоДаннымМП.ПричинаНеВыполнения,
	|	ОперативныеСтатусыЗаказовПоДаннымМП.ПричинаОтказаПереноса,
	|	ОперативныеСтатусыЗаказовПоДаннымМП.Регистратор,
	|	3,
	|	ВЫБОР
	|		КОГДА ОперативныеСтатусыЗаказовПоДаннымМП.Рейс.ДатаРейса ЕСТЬ NULL
	|			ТОГДА НАЧАЛОПЕРИОДА(ОперативныеСтатусыЗаказовПоДаннымМП.Период, ДЕНЬ)
	|		КОГДА НАЧАЛОПЕРИОДА(ОперативныеСтатусыЗаказовПоДаннымМП.Период, ДЕНЬ) > ОперативныеСтатусыЗаказовПоДаннымМП.Рейс.ДатаРейса
	|			ТОГДА ОперативныеСтатусыЗаказовПоДаннымМП.Рейс.ДатаРейса
	|		ИНАЧЕ НАЧАЛОПЕРИОДА(ОперативныеСтатусыЗаказовПоДаннымМП.Период, ДЕНЬ)
	|	КОНЕЦ,
	|	ОперативныеСтатусыЗаказовПоДаннымМП.Рейс.ДатаРейса
	|ИЗ
	|	РегистрСведений.ОперативныеСтатусыЗаказовПоДаннымМП КАК ОперативныеСтатусыЗаказовПоДаннымМП
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Заказы КАК ВТ_Заказы
	|		ПО (ОперативныеСтатусыЗаказовПоДаннымМП.Период МЕЖДУ &НачалоПериода И &ОкончаниеПериода30)
	|			И ОперативныеСтатусыЗаказовПоДаннымМП.Заказ = ВТ_Заказы.Заказ
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтатусыЗаказов КАК СтатусыЗаказов
	|		ПО ОперативныеСтатусыЗаказовПоДаннымМП.Заказ = СтатусыЗаказов.Заказ
	|			И (СтатусыЗаказов.Статус = 237)
	|			И ОперативныеСтатусыЗаказовПоДаннымМП.Регистратор = СтатусыЗаказов.ДокументРегистратор
	|
	|УПОРЯДОЧИТЬ ПО
	|	Заказ,
	|	ДатаСтатуса,
	|	Период
	|ИТОГИ ПО
	|	Заказ,
	|	ДатаСтатуса";
	
	ТаблицаСтатусовЗаказа = Новый ТаблицаЗначений;
	КолонкиТаблицы = ТаблицаСтатусовЗаказа.Колонки;
	КолонкиТаблицы.Добавить("Заказ");
	КолонкиТаблицы.Добавить("НомерВнешнегоЗаказа");
	КолонкиТаблицы.Добавить("НомерСтатуса");
	КолонкиТаблицы.Добавить("Период");
	КолонкиТаблицы.Добавить("РезультатДоставки");
	КолонкиТаблицы.Добавить("ПричинаНеВыполнения");
	КолонкиТаблицы.Добавить("ПричинаОтказа");
	КолонкиТаблицы.Добавить("Регистратор");
	КолонкиТаблицы.Добавить("ИсточникСтатуса");
	КолонкиТаблицы.Добавить("ДатаСтатуса");
	КолонкиТаблицы.Добавить("ДатаРейса");
	
	
	ТаблицаСтатусовЗаказов = ТаблицаСтатусовЗаказа.СкопироватьКолонки();
	
	СтруктураРезультатДоставки = Новый Структура("РезультатДоставки");
	
	ВыборкаЗаказ = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаЗаказ.Следующий() Цикл
		
		НомерСтатуса = 0;
		
		ВыборкаДатаСтатуса = ВыборкаЗаказ.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаДатаСтатуса.Следующий() Цикл
			
			ТаблицаСтатусовЗаказа.Очистить();
			
			Выборка = ВыборкаДатаСтатуса.Выбрать();
			Пока Выборка.Следующий() Цикл
				ЗаполнитьЗначенияСвойств(ТаблицаСтатусовЗаказа.Добавить(), Выборка);
			КонецЦикла;
			
			//обрабатываем таблицу
			ИндексПоследнейСтроки = ТаблицаСтатусовЗаказа.Количество() - 1;
			ПоследняяСтрокаТаблицы = ТаблицаСтатусовЗаказа[ИндексПоследнейСтроки];
			
			РезультатДоставки = ПоследняяСтрокаТаблицы.РезультатДоставки;
			
			//собирем инфу по этому результату
			СтруктураРезультатДоставки.РезультатДоставки = РезультатДоставки;
			СтрокиТаблицы = ТаблицаСтатусовЗаказа.НайтиСтроки(СтруктураРезультатДоставки);
			
			ПерваяСтрокаТаблицы = СтрокиТаблицы[0];
			
			ПричинаНеВыполнения = Неопределено;
			ПричинаОтказа = Неопределено;
			
			Для Каждого СтрокаТаблицы Из СтрокиТаблицы Цикл
				Если ЗначениеЗаполнено(СтрокаТаблицы.ПричинаНеВыполнения) Тогда
					ПричинаНеВыполнения = СтрокаТаблицы.ПричинаНеВыполнения;
				КонецЕсли;
				Если ЗначениеЗаполнено(СтрокаТаблицы.ПричинаОтказа) Тогда
					ПричинаОтказа = СтрокаТаблицы.ПричинаОтказа;
				КонецЕсли;
			КонецЦикла;
			
			НомерСтатуса = НомерСтатуса + 1;
			
			СтрокаСтатусовЗаказов = ТаблицаСтатусовЗаказов.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаСтатусовЗаказов, ПерваяСтрокаТаблицы);
			СтрокаСтатусовЗаказов.НомерСтатуса = НомерСтатуса;
			СтрокаСтатусовЗаказов.ПричинаНеВыполнения = ПричинаНеВыполнения;
			СтрокаСтатусовЗаказов.ПричинаОтказа = ПричинаОтказа;
			
		КонецЦикла;
		
		
	КонецЦикла;
	
	ВнешниеНаборыДанных.Вставить("ТаблицаСтатусовЗаказов", ТаблицаСтатусовЗаказов);
	
	Возврат ВнешниеНаборыДанных;
	
КонецФункции

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	НастройкиКомпоновщика = КомпоновщикНастроек.ПолучитьНастройки();
	
	ЭлементыПараметров = НастройкиКомпоновщика.ПараметрыДанных.Элементы;
	
	СтандартныйПериод = ЭлементыПараметров.Найти("Период").Значение;

	Контрагент = ЭлементыПараметров.Найти("Контрагент").Значение;
	
	Если ЗначениеЗаполнено(СтандартныйПериод) И ЗначениеЗаполнено(СтандартныйПериод.ДатаНачала) И ЗначениеЗаполнено(СтандартныйПериод.ДатаОкончания) И ЗначениеЗаполнено(Контрагент) Тогда
		
	Иначе
		ВызватьИсключение "Не заполнены обязательные параметры отчета";
	КонецЕсли;
	
	ВнешниеНаборыДанных = ПолучитьВнешниеНаборыДанных(СтандартныйПериод.ДатаНачала, СтандартныйПериод.ДатаОкончания, Контрагент);
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, НастройкиКомпоновщика, ДанныеРасшифровки);

	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки, ВнешниеНаборыДанных, ДанныеРасшифровки, Истина);

	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
	
	ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	
КонецПроцедуры
